Repository: ereztzafar/LOTTOLUCK
Catalog: lib/l10n/app_*.arb
Languages: ar, es, fr, he, pt, ru

# register_title
source: Register to LOTTOLUCK
ar: التسجيل في LOTTOLUCK
es: Registro en LOTTOLUCK
fr: Inscription à LOTTOLUCK
he: הרשמה ל־LOTTOLUCK
pt: Registro no LOTTOLUCK
ru: Регистрация в LOTTOLUCK

# tagline_connect_luck
source: 🧙‍♂️ Connect to your luck
ar: 🧙‍♂️ اتصل بحظك
es: 🧙‍♂️ Conéctate con tu suerte
fr: 🧙‍♂️ Connectez-vous à votre chance
he: 🧙‍♂️ התחבר למזל שלך
pt: 🧙‍♂️ Conecte-se à sua sorte
ru: 🧙‍♂️ Подключись к своей удаче

# first_name_label
source: First name
ar: الاسم الأول
es: Nombre
fr: Prénom
he: שם פרטי
pt: Nome
ru: Имя

# birth_date_label
source: Birth date
ar: تاريخ الميلاد
es: Fecha de nacimiento
fr: Date de naissance
he: תאריך לידה
pt: Data de nascimento
ru: Дата рождения

# birth_time_label
source: Birth time
ar: وقت الميلاد
es: Hora de nacimiento
fr: Heure de naissance
he: שעת לידה
pt: Hora de nascimento
ru: Время рождения

# time_zone_label
source: Time zone (IANA)
ar: المنطقة الزمنية (IANA)
es: Zona horaria (IANA)
fr: Fuseau horaire (IANA)
he: אזור זמן (IANA)
pt: Fuso horário (IANA)
ru: Часовой пояс (IANA)

# house_system_label
source: House system
ar: نظام البيوت
es: Sistema de casas
fr: Système des maisons
he: שיטת חישוב בתים
pt: Sistema de casas
ru: Система домов

# city_selected_template
source: {city}, {country} · Lat: {lat}, Lon: {lon}
ar: {city}، {country} · خط العرض: {lat}، خط الطول: {lon}
ru: {city}, {country} · Шир: {lat}, Долг: {lon}

# save_step1_button
source: Save step 1 (local)
ar: حفظ المرحلة 1 (محلي)
es: Guardar paso 1 (local)
fr: Enregistrer l’étape 1 (local)
he: שמור שלב 1 (לוקאלי)
pt: Salvar etapa 1 (local)
ru: Сохранить шаг 1 (локально)

# show_forecast_button
source: Show forecast
ar: عرض التوقع
es: Mostrar pronóstico
fr: Afficher le prévisionnel
he: הצג תחזית
pt: Mostrar previsão
ru: Показать прогноз

# form_incomplete_hint
source: Please fill name, city, date, time and time zone
ar: يرجى ملء الاسم، المدينة، التاريخ، الوقت والمنطقة الزمنية
es: Complete nombre, ciudad, fecha, hora y zona horaria
fr: Veuillez renseigner le nom, la ville, la date, l’heure et le fuseau horaire
he: יש למלא שם, עיר, תאריך, שעה ואזור זמן
pt: Preencha nome, cidade, data, hora e fuso horário
ru: Заполните имя, город, дату, время и часовой пояс

# daily_forecast_title
source: 🔮 Daily forecast • {date}
ar: 🔮 التوقع اليومي • {date}
es: 🔮 Pronóstico diario • {date}
fr: 🔮 Prévision du jour • {date}
he: 🔮 תחזית יומית • {date}
pt: 🔮 Previsão diária • {date}
ru: 🔮 Ежедневный прогноз • {date}

# natal_title
source: ✨ Natal
ar: ✨ الولادة (Natal)
he: ✨ לידה (Natal)
ru: ✨ Натал

# transit_title
source: 🚀 Transit
ar: 🚀 العبور (Transit)
es: 🚀 Tránsito
he: 🚀 מעבר (Transit)
pt: 🚀 Trânsito
ru: 🚀 Транзит

# no_aspects
source: No aspects in the defined orb range.
ar: لا توجد زوايا ضمن مدى الأورب المحدد.
es: No hay aspectos en el orbe definido.
fr: Aucun aspect dans l’orbe défini.
he: אין היבטים בטווח האורב שהוגדר.
pt: Sem aspectos no orbe definido.
ru: Нет аспектов в заданном орбе.

# show_all_aspects
source: Show all {count} aspects
ar: عرض جميع الزوايا ({count})
es: Mostrar los {count} aspectos
fr: Afficher les {count} aspects
he: הצג את כל {count} ההיבטים
pt: Mostrar todos os {count} aspectos
ru: Показать все аспекты ({count})

source: Show less
ar: عرض أقل
es: Mostrar menos
fr: Afficher moins
he: הצג פחות
pt: Mostrar menos
ru: Показать меньше

# wheel_unavailable
source: Wheel view is not available.
ar: عرض العجلة غير متاح.
es: La vista de rueda no está disponible.
fr: La roue n’est pas disponible.
he: תצוגת גלגל אינה זמינה.
pt: A visualização da roda não está disponível.
ru: Вид колеса недоступен.

source: Hide aspects
ar: إخفاء الزوايا
es: Ocultar aspectos
fr: Masquer les aspects
he: הסתר אספקטים
pt: Ocultar aspectos
ru: Скрыть аспекты

source: Show aspects
ar: إظهار الزوايا
es: Mostrar aspectos
fr: Afficher les aspects
he: הצג אספקטים
pt: Mostrar aspectos
ru: Показать аспекты

# lucky_hours_title
source: 🎯 Lucky hours (free – next 2 windows)
ar: 🎯 ساعات الحظ (مجاني – أقرب نافذتين)
es: 🎯 Horas de suerte (gratis – 2 próximas ventanas)
fr: 🎯 Heures porte-bonheur (gratuit – 2 prochains créneaux)
he: 🎯 שעות מזל (חינמי – 2 חלונות קרובים)
pt: 🎯 Horas da sorte (grátis – 2 próximas janelas)
ru: 🎯 Счастливые часы (бесплатно – ближайшие 2 окна)

# open_pro_button
source: Open full PRO screen
ar: افتح شاشة PRO الكاملة
es: Abrir pantalla PRO completa
fr: Ouvrir l’écran PRO complet
he: פתח מסך PRO המלא
pt: Abrir tela PRO completa
ru: Открыть полный экран PRO

# pro_only_snackbar
source: PRO screen is available to subscribers only.
ar: شاشة PRO متاحة للمشتركين فقط.
es: La pantalla PRO está disponible solo para suscriptores.
fr: L’écran PRO est réservé aux abonnés.
he: מסך PRO זמין למנויים בלבד.
pt: A tela PRO está disponível apenas para assinantes.
ru: Экран PRO доступен только подписчикам.

# meta_house_tz
source: TZ: {tz} • Houses: {house}
ar: المنطقة: {tz} • البيوت: {house}
es: TZ: {tz} • Casas: {house}
fr: TZ : {tz} • Maisons : {house}
he: TZ: {tz} • בתים: {house}
pt: TZ: {tz} • Casas: {house}
ru: Пояс: {tz} • Дома: {house}

# error_running_forecast
source: Error running forecast: {error}
ar: خطأ أثناء تشغيل التوقع: {error}
es: Error al ejecutar el pronóstico: {error}
fr: Erreur lors de l’exécution du prévisionnel : {error}
he: שגיאה בהרצת התחזית: {error}
pt: Erro ao executar a previsão: {error}
ru: Ошибка выполнения прогноза: {error}
